results/out/aleph.ring-interceptors.async.java11.ZGC.r20k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.711ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.772ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.988ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.734ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.822ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.801ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.830ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.636ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.773ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.669ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.884ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.780ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.837ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.772ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.75ms    2.26ms  66.69ms   95.44%
    Req/Sec     1.32k   522.78     4.67k    67.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30ms
 75.000%    1.89ms
 90.000%    2.73ms
 99.000%   12.34ms
 99.900%   27.34ms
 99.990%   40.64ms
 99.999%   54.59ms
100.000%   66.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.080     0.000000            1         1.00
       0.519     0.100000      1181614         1.11
       0.752     0.200000      2365117         1.25
       0.944     0.300000      3539398         1.43
       1.122     0.400000      4724303         1.67
       1.299     0.500000      5898902         2.00
       1.396     0.550000      6494231         2.22
       1.501     0.600000      7082367         2.50
       1.618     0.650000      7671741         2.86
       1.745     0.700000      8259180         3.33
       1.890     0.750000      8848424         4.00
       1.975     0.775000      9142998         4.44
       2.075     0.800000      9443421         5.00
       2.189     0.825000      9734182         5.71
       2.329     0.850000     10029820         6.67
       2.503     0.875000     10323205         8.00
       2.609     0.887500     10470947         8.89
       2.733     0.900000     10618238        10.00
       2.885     0.912500     10765709        11.43
       3.077     0.925000     10913014        13.33
       3.343     0.937500     11060827        16.00
       3.525     0.943750     11134304        17.78
       3.761     0.950000     11207536        20.00
       4.143     0.956250     11281784        22.86
       4.843     0.962500     11355135        26.67
       5.887     0.968750     11428733        32.00
       6.519     0.971875     11465696        35.56
       7.231     0.975000     11502515        40.00
       7.959     0.978125     11539444        45.71
       8.711     0.981250     11576339        53.33
       9.783     0.984375     11613117        64.00
      10.391     0.985938     11631715        71.11
      11.063     0.987500     11650011        80.00
      11.831     0.989062     11668433        91.43
      12.751     0.990625     11686934       106.67
      13.887     0.992188     11705273       128.00
      14.511     0.992969     11714460       142.22
      15.239     0.993750     11723743       160.00
      16.039     0.994531     11732937       182.86
      17.023     0.995313     11742198       213.33
      18.207     0.996094     11751364       256.00
      18.847     0.996484     11755940       284.44
      19.583     0.996875     11760625       320.00
      20.431     0.997266     11765161       365.71
      21.679     0.997656     11769783       426.67
      23.007     0.998047     11774360       512.00
      23.695     0.998242     11776664       568.89
      24.447     0.998437     11779001       640.00
      25.343     0.998633     11781291       731.43
      26.367     0.998828     11783607       853.33
      27.487     0.999023     11785908      1024.00
      28.095     0.999121     11787048      1137.78
      28.783     0.999219     11788186      1280.00
      29.663     0.999316     11789343      1462.86
      30.687     0.999414     11790501      1706.67
      31.791     0.999512     11791652      2048.00
      32.431     0.999561     11792230      2275.56
      33.151     0.999609     11792817      2560.00
      33.919     0.999658     11793374      2925.71
      34.783     0.999707     11793959      3413.33
      35.871     0.999756     11794532      4096.00
      36.479     0.999780     11794816      4551.11
      37.119     0.999805     11795104      5120.00
      37.823     0.999829     11795391      5851.43
      38.591     0.999854     11795675      6826.67
      39.519     0.999878     11795970      8192.00
      40.031     0.999890     11796109      9102.22
      40.831     0.999902     11796251     10240.00
      41.535     0.999915     11796395     11702.86
      42.559     0.999927     11796542     13653.33
      43.551     0.999939     11796682     16384.00
      44.159     0.999945     11796755     18204.44
      44.799     0.999951     11796826     20480.00
      45.407     0.999957     11796899     23405.71
      46.559     0.999963     11796969     27306.67
      47.583     0.999969     11797042     32768.00
      48.287     0.999973     11797077     36408.89
      48.959     0.999976     11797113     40960.00
      49.887     0.999979     11797149     46811.43
      50.879     0.999982     11797186     54613.33
      52.127     0.999985     11797222     65536.00
      52.735     0.999986     11797239     72817.78
      53.311     0.999988     11797257     81920.00
      54.207     0.999989     11797276     93622.86
      55.007     0.999991     11797293    109226.67
      55.967     0.999992     11797311    131072.00
      56.511     0.999993     11797320    145635.56
      56.863     0.999994     11797329    163840.00
      57.759     0.999995     11797338    187245.71
      58.303     0.999995     11797347    218453.33
      59.839     0.999996     11797356    262144.00
      60.383     0.999997     11797361    291271.11
      60.863     0.999997     11797365    327680.00
      61.183     0.999997     11797371    374491.43
      61.375     0.999998     11797374    436906.67
      61.951     0.999998     11797379    524288.00
      62.015     0.999998     11797381    582542.22
      62.239     0.999998     11797383    655360.00
      62.943     0.999999     11797387    748982.86
      63.007     0.999999     11797388    873813.33
      63.423     0.999999     11797390   1048576.00
      63.487     0.999999     11797392   1165084.44
      63.487     0.999999     11797392   1310720.00
      63.743     0.999999     11797394   1497965.71
      63.967     0.999999     11797395   1747626.67
      64.863     1.000000     11797396   2097152.00
      64.863     1.000000     11797396   2330168.89
      65.215     1.000000     11797398   2621440.00
      65.215     1.000000     11797398   2995931.43
      65.215     1.000000     11797398   3495253.33
      65.279     1.000000     11797399   4194304.00
      65.279     1.000000     11797399   4660337.78
      65.279     1.000000     11797399   5242880.00
      65.983     1.000000     11797400   5991862.86
      65.983     1.000000     11797400   6990506.67
      65.983     1.000000     11797400   8388608.00
      65.983     1.000000     11797400   9320675.55
      65.983     1.000000     11797400  10485760.00
      66.751     1.000000     11797401  11983725.71
      66.751     1.000000     11797401          inf
#[Mean    =        1.746, StdDeviation   =        2.258]
#[Max     =       66.688, Total count    =     11797401]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11998627 requests in 10.00m, 2.00GB read
Requests/sec:  19997.67
Transfer/sec:      3.41MB